import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-news',
  templateUrl: './news.component.html',
  styleUrls: ['./news.component.css']
})
export class NewsComponent implements OnInit {
  posts = [
    {
      id: 1,
      title: '範例文章標題X',
      date: new Date(),
      author: {
        name: '某人',
        link: '//fb.com/yu.chen.142857'
      },
      image: '//i.imgur.com/mM3xVtJ.jpg',
      content: '人受獎之不中呢樓異地安學手決樣是里斯股結樂是會確過的在時法動童獎科子改團去滿親到。助天友：了的於？遠有下回定下病東作進起正類說案理政再黨下問的：是有工歡響望來員形夫然臺得地值；打頭親地線苦大當境給中；在政嚴母己算前質你活他可突、區始你、相收去後黑關因多海定直生銷成軍。北他明也臉高跟女興不於，下然排統調觀我力的因真十或上行少動學手化運象理才園裡清在聽接打文事葉好不看一父文經。將為馬面書而功次們！紅後中而文女會根體統動以己兒步人緊當水弟男的速商地舞我過出但時知就子。灣對名有質極也為球他市然怎如近能樣施。界用體汽好但各，安門傳，個身成他，府常遠空機公農員下也白福響！任上活由去大年發環元精結信山廣人提出手團些辦以校當屋他一北裝德出課球北但完參的門都火政你我除的種是種康！去日時年務出……黃類然發子早……都車兒溫；過視得，動樣分灣整國家生。'
    },
    {
      id: 1,
      title: '範例文章標題2',
      date: new Date(),
      author: {
        name: '某人',
        link: '//fb.com/yu.chen.142857'
      },
      image: '//i.imgur.com/mM3xVtJ.jpg',
      content: '人受獎之不中呢樓異地安學手決樣是里斯股結樂是會確過的在時法動童獎科子改團去滿親到。助天友：了的於？遠有下回定下病東作進起正類說案理政再黨下問的：是有工歡響望來員形夫然臺得地值；打頭親地線苦大當境給中；在政嚴母己算前質你活他可突、區始你、相收去後黑關因多海定直生銷成軍。北他明也臉高跟女興不於，下然排統調觀我力的因真十或上行少動學手化運象理才園裡清在聽接打文事葉好不看一父文經。將為馬面書而功次們！紅後中而文女會根體統動以己兒步人緊當水弟男的速商地舞我過出但時知就子。灣對名有質極也為球他市然怎如近能樣施。界用體汽好但各，安門傳，個身成他，府常遠空機公農員下也白福響！任上活由去大年發環元精結信山廣人提出手團些辦以校當屋他一北裝德出課球北但完參的門都火政你我除的種是種康！去日時年務出……黃類然發子早……都車兒溫；過視得，動樣分灣整國家生。'
    }
  ]
  constructor() { }

  ngOnInit() {
  }

}
